-- phpMyAdmin SQL Dump
-- version 4.2.7.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2018-12-19 09:57:55
-- 服务器版本： 5.5.39
-- PHP Version: 5.4.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `garage`
--

-- --------------------------------------------------------

--
-- 表的结构 `all_garage_status`
--

CREATE TABLE IF NOT EXISTS `all_garage_status` (
`id` int(10) NOT NULL,
  `total_num` int(10) NOT NULL,
  `used_num` int(10) NOT NULL,
  `not_used_num` int(10) NOT NULL,
  `fault_num` int(10) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `all_garage_status`
--

INSERT INTO `all_garage_status` (`id`, `total_num`, `used_num`, `not_used_num`, `fault_num`) VALUES
(1, 108, 88, 18, 2);

-- --------------------------------------------------------

--
-- 表的结构 `back_danpianji`
--

CREATE TABLE IF NOT EXISTS `back_danpianji` (
  `id` int(10) NOT NULL,
  `now_time` varchar(25) COLLATE utf8_bin NOT NULL,
  `back` varchar(100) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `back_danpianji`
--

INSERT INTO `back_danpianji` (`id`, `now_time`, `back`) VALUES
(1, '2018-12-19 16:57:47', '{"device_id":"1","cp_num":"0","error":"0","get_floor_1":"0","led":"5","money":"0"}');

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

CREATE TABLE IF NOT EXISTS `comment` (
`id` int(11) NOT NULL,
  `content` text NOT NULL,
  `user_id` int(11) NOT NULL,
  `username` varchar(20) NOT NULL,
  `entity_id` int(11) NOT NULL,
  `entity_type` int(11) NOT NULL,
  `created_date` datetime NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=27 ;

--
-- 转存表中的数据 `comment`
--

INSERT INTO `comment` (`id`, `content`, `user_id`, `username`, `entity_id`, `entity_type`, `created_date`, `status`) VALUES
(1, 'https://wenku.baidu.com/view/bbf095a6f524ccbff12184ec.html', 12, '', 11, 1, '2018-07-30 16:15:29', 0),
(2, 'https://wenku.baidu.com/view/bbf095a6f524ccbff12184ec.html', 12, '', 11, 1, '2018-07-30 16:15:37', 0),
(3, 'iloioli', 12, '', 13, 1, '2018-07-31 14:53:29', 0),
(4, 'werwer', 3, '', 12, 1, '2018-07-31 14:56:32', 0),
(5, '', 12, '', 13, 1, '2018-09-02 13:12:41', 0),
(6, 'gbhfghdg', 12, '', 14, 1, '2018-09-18 11:18:51', 0),
(7, '梵蒂冈梵蒂冈', 12, '', 15, 1, '2018-09-26 10:42:05', 0),
(8, '123456', 10, '', 18, 1, '2018-09-30 13:15:19', 0),
(9, 'dsfsdf', 10, 'wan', 18, 1, '2018-09-30 13:27:49', 0),
(10, '12321312', 10, 'wan', 18, 1, '2018-09-30 13:32:41', 0),
(11, 'gffsffg', 10, 'wan', 18, 1, '2018-09-30 13:33:21', 0),
(12, 'dsfadsa', 10, 'wan', 18, 1, '2018-09-30 13:34:49', 0),
(13, 'sadfsf', 10, 'wan', 18, 1, '2018-09-30 13:37:25', 0),
(14, '第三方士大夫', 13, 'user1', 20, 1, '2018-10-15 15:43:39', 0),
(15, '法师打发士大夫胜多负少', 10, 'user1', 16, 1, '2018-10-18 13:45:12', 0),
(16, '水电费水电费水电费是的', 10, 'user1', 23, 1, '2018-10-18 13:47:23', 0),
(17, '发的规范的非官方大哥', 10, 'user1', 23, 1, '2018-10-18 13:53:46', 0),
(18, '发给撒大哥是的范德萨', 10, 'user1', 23, 1, '2018-10-18 14:37:22', 0),
(19, '发打发士大夫士大夫撒', 10, 'user1', 23, 1, '2018-10-18 14:37:31', 0),
(20, '规范化规范化', 9, 'li', 22, 1, '2018-11-28 15:51:19', 0),
(21, '水电费水电费', 9, 'li', 11, 1, '2018-12-07 17:26:31', 0),
(22, '范德萨范德萨', 9, 'li', 9, 1, '2018-12-07 17:27:59', 0),
(23, '双方的公司大', 9, 'li', 9, 1, '2018-12-07 17:31:42', 0),
(24, '大锅饭当梵蒂冈', 9, 'li', 9, 1, '2018-12-07 21:37:49', 0),
(25, '个梵蒂冈', 9, 'li', 10, 1, '2018-12-07 21:37:56', 0),
(26, '地方撒地方是的', 9, 'li', 7, 1, '2018-12-07 21:38:07', 0);

-- --------------------------------------------------------

--
-- 表的结构 `danpianji`
--

CREATE TABLE IF NOT EXISTS `danpianji` (
`id` int(10) NOT NULL,
  `time1` varchar(20) COLLATE utf8_bin NOT NULL,
  `device_id` int(20) NOT NULL,
  `car_num` varchar(100) COLLATE utf8_bin NOT NULL,
  `free_num` int(10) NOT NULL,
  `floor_1` varchar(20) COLLATE utf8_bin NOT NULL,
  `all_floor` varchar(100) COLLATE utf8_bin NOT NULL,
  `datas` varchar(500) COLLATE utf8_bin NOT NULL,
  `len` int(20) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `danpianji`
--

INSERT INTO `danpianji` (`id`, `time1`, `device_id`, `car_num`, `free_num`, `floor_1`, `all_floor`, `datas`, `len`) VALUES
(1, '2018-12-19 16:57:47', 1, '0', 7, '0', '00111001001', '{"id":"1","car":"no","free_num":"7","all":"00111001001","f_1":"0","fault":"111110","out":"no"}', 94);

-- --------------------------------------------------------

--
-- 表的结构 `fault_history`
--

CREATE TABLE IF NOT EXISTS `fault_history` (
`id` int(10) NOT NULL,
  `garage_id` int(10) NOT NULL,
  `address` varchar(20) COLLATE utf8_bin NOT NULL,
  `jiechu_state` int(10) NOT NULL,
  `fault_type` varchar(20) COLLATE utf8_bin NOT NULL,
  `jianxiu_state` int(1) NOT NULL,
  `submit_time` datetime NOT NULL,
  `jiechu_time` datetime DEFAULT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `fault_history`
--

INSERT INTO `fault_history` (`id`, `garage_id`, `address`, `jiechu_state`, `fault_type`, `jianxiu_state`, `submit_time`, `jiechu_time`) VALUES
(1, 2, '江苏省南京市2号车库', 0, '急停报警', 0, '2018-09-01 11:14:15', '2018-09-06 11:16:13'),
(2, 2, '江苏省南京市2号车库', 0, '防松链报警', 1, '2018-09-02 11:14:15', '2018-09-06 11:16:13'),
(3, 4, '江苏省南京市4号车库', 0, '光电报警', 1, '2018-09-03 11:14:15', NULL),
(4, 3, '江苏省南京市3号车库', 0, '防松链报警', 1, '2018-09-04 11:14:15', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `fault_warning`
--

CREATE TABLE IF NOT EXISTS `fault_warning` (
`id` int(11) NOT NULL,
  `ji_ting` int(11) NOT NULL,
  `guang_dian` int(11) NOT NULL,
  `re_ji_guo_zai` int(1) NOT NULL,
  `duan_dian` int(11) NOT NULL,
  `fang_song_lian` int(11) NOT NULL,
  `ji_xian` int(11) NOT NULL,
  `gua_gou` int(11) NOT NULL,
  `xiang_xu` int(11) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `fault_warning`
--

INSERT INTO `fault_warning` (`id`, `ji_ting`, `guang_dian`, `re_ji_guo_zai`, `duan_dian`, `fang_song_lian`, `ji_xian`, `gua_gou`, `xiang_xu`) VALUES
(1, 1, 1, 1, 0, 1, 1, 0, 0),
(2, 0, 0, 1, 0, 0, 0, 0, 0),
(3, 0, 0, 0, 0, 0, 0, 0, 0),
(4, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `feed`
--

CREATE TABLE IF NOT EXISTS `feed` (
`id` int(11) NOT NULL,
  `created_date` datetime DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `data` tinytext,
  `type` int(11) DEFAULT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=6 ;

--
-- 转存表中的数据 `feed`
--

INSERT INTO `feed` (`id`, `created_date`, `user_id`, `data`, `type`) VALUES
(1, '2018-11-29 17:19:05', 8, '{"userHead":"http://images.nowcoder.com/head/435t.png","questionId":"10","questionTitle":"TITLE{9}","userName":"USER8","userId":"8"}', 4),
(2, '2018-12-07 17:31:42', 5, '{"questionId":"9","questionTitle":"TITLE{8}","userName":"wangwu","userId":"5"}', 6),
(3, '2018-12-07 21:37:49', 8, '{"questionId":"9","questionTitle":"TITLE{8}","userName":"fan","userId":"8"}', 6),
(4, '2018-12-07 21:37:56', 6, '{"questionId":"10","questionTitle":"TITLE{9}","userName":"liu","userId":"6"}', 6),
(5, '2018-12-07 21:38:07', 4, '{"questionId":"7","questionTitle":"TITLE{6}","userName":"lisi","userId":"4"}', 6);

-- --------------------------------------------------------

--
-- 表的结构 `garage_info`
--

CREATE TABLE IF NOT EXISTS `garage_info` (
`id` int(10) NOT NULL,
  `latitude` float NOT NULL,
  `longtitude` float NOT NULL,
  `address` varchar(25) COLLATE utf8_bin NOT NULL,
  `total_num` int(10) NOT NULL,
  `free_num` int(10) NOT NULL,
  `price_per_hour` float NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=159 ;

--
-- 转存表中的数据 `garage_info`
--

INSERT INTO `garage_info` (`id`, `latitude`, `longtitude`, `address`, `total_num`, `free_num`, `price_per_hour`) VALUES
(1, 31.0429, 120.82, '江苏省1号车库', 13, 10, 10),
(2, 32.0576, 118.932, '江苏省南京市2号车库', 100, 38, 8),
(3, 32.076, 118.856, '江苏省南京市3号车库', 80, 17, 6),
(4, 32.0875, 118.766, '江苏省南京市4号车库', 60, 40, 9),
(5, 32.042, 118.856, '江苏省南京市5号车库', 80, 17, 6),
(6, 32.042, 118.956, '江苏省南京市6号车库', 80, 17, 6),
(7, 32.032, 118.556, '江苏省南京市7号车库', 80, 17, 6),
(8, 32.032, 118.556, '江苏省南京市8号车库', 80, 17, 6),
(9, 32.0534, 118.811, '江苏省南京市9号车库', 30, 20, 10),
(10, 32.055, 118.806, '江苏省南京市10号车库', 31, 21, 10.1),
(11, 32.0562, 118.806, '江苏省南京市11号车库', 32, 22, 10.2),
(13, 32.0655, 118.812, '江苏省南京市13号车库', 34, 24, 10.4),
(14, 32.057, 118.811, '江苏省南京市14号车库', 35, 25, 10.5),
(15, 32.0781, 118.781, '江苏省南京市15号车库', 36, 25, 10.6),
(16, 32.0601, 118.781, '江苏省南京市16号车库', 37, 27, 10.7),
(17, 32.0473, 118.847, '江苏省南京市17号车库', 38, 28, 10.8),
(18, 32.0602, 118.79, '江苏省南京市18号车库', 39, 29, 10.9),
(19, 32.0605, 118.779, '江苏省南京市19号车库', 40, 30, 11),
(20, 32.0705, 118.835, '江苏省南京市20号车库', 41, 31, 11.1),
(23, 32.0408, 118.843, '江苏省南京市23号车库', 44, 34, 11.4),
(24, 32.0802, 118.851, '江苏省南京市24号车库', 45, 35, 11.5),
(25, 32.0479, 118.85, '江苏省南京市25号车库', 46, 36, 11.6),
(26, 32.0408, 118.751, '江苏省南京市26号车库', 47, 37, 11.7),
(27, 32.0411, 118.779, '江苏省南京市27号车库', 48, 38, 11.8),
(28, 32.0674, 118.759, '江苏省南京市28号车库', 49, 39, 11.9),
(29, 32.0384, 118.758, '江苏省南京市29号车库', 50, 40, 12),
(30, 32.0602, 118.825, '江苏省南京市30号车库', 51, 41, 12.1),
(31, 32.0704, 118.832, '江苏省南京市31号车库', 52, 42, 12.2),
(32, 32.0752, 118.817, '江苏省南京市32号车库', 53, 42, 12.3),
(33, 32.0442, 118.821, '江苏省南京市33号车库', 54, 43, 12.4),
(35, 32.0776, 118.766, '江苏省南京市35号车库', 56, 46, 12.6),
(36, 32.0351, 118.776, '江苏省南京市36号车库', 57, 47, 12.7),
(38, 32.0574, 118.784, '江苏省南京市38号车库', 59, 49, 12.9),
(39, 32.0366, 118.758, '江苏省南京市39号车库', 60, 50, 13),
(40, 32.0462, 118.842, '江苏省南京市40号车库', 61, 51, 13.1),
(41, 32.0673, 118.83, '江苏省南京市41号车库', 62, 52, 13.2),
(42, 32.0354, 118.848, '江苏省南京市42号车库', 63, 53, 13.3),
(43, 32.0756, 118.766, '江苏省南京市43号车库', 64, 54, 13.4),
(44, 32.0497, 118.755, '江苏省南京市44号车库', 65, 55, 13.5),
(45, 32.0768, 118.775, '江苏省南京市45号车库', 66, 56, 13.6),
(46, 32.0566, 118.811, '江苏省南京市46号车库', 67, 57, 13.7),
(48, 32.0602, 118.745, '江苏省南京市48号车库', 69, 58, 13.9),
(49, 32.0711, 118.783, '江苏省南京市49号车库', 70, 60, 14),
(51, 32.0464, 118.76, '江苏省南京市51号车库', 72, 62, 14.2),
(52, 32.063, 118.771, '江苏省南京市52号车库', 73, 63, 14.3),
(53, 32.0737, 118.749, '江苏省南京市53号车库', 74, 64, 14.4),
(54, 32.0739, 118.851, '江苏省南京市54号车库', 75, 65, 14.5),
(55, 32.0868, 118.829, '江苏省南京市55号车库', 76, 63, 14.6),
(56, 32.0713, 118.759, '江苏省南京市56号车库', 77, 67, 14.7),
(57, 32.087, 118.84, '江苏省南京市57号车库', 78, 68, 14.8),
(58, 32.0581, 118.799, '江苏省南京市58号车库', 79, 68, 14.9),
(59, 32.0181, 118.751, '江苏省南京市59号车库', 30, 20, 10),
(60, 32.015, 118.8, '江苏省南京市60号车库', 31, 21, 10.1),
(61, 32.0192, 118.775, '江苏省南京市61号车库', 32, 22, 10.2),
(62, 32.0139, 118.799, '江苏省南京市62号车库', 33, 23, 10.3),
(63, 32.0362, 118.75, '江苏省南京市63号车库', 34, 24, 10.4),
(64, 32.0124, 118.79, '江苏省南京市64号车库', 35, 25, 10.5),
(65, 32.0285, 118.766, '江苏省南京市65号车库', 36, 26, 10.6),
(66, 32.0235, 118.844, '江苏省南京市66号车库', 37, 27, 10.7),
(67, 32.0293, 118.819, '江苏省南京市67号车库', 38, 28, 10.8),
(68, 32.003, 118.753, '江苏省南京市68号车库', 39, 29, 10.9),
(69, 32.0231, 118.82, '江苏省南京市69号车库', 40, 30, 11),
(70, 32.0338, 118.819, '江苏省南京市70号车库', 41, 31, 11.1),
(71, 32.0217, 118.764, '江苏省南京市71号车库', 42, 32, 11.2),
(72, 32.0356, 118.779, '江苏省南京市72号车库', 43, 33, 11.3),
(73, 32.0351, 118.844, '江苏省南京市73号车库', 44, 34, 11.4),
(74, 32.0213, 118.823, '江苏省南京市74号车库', 45, 35, 11.5),
(75, 32.0061, 118.762, '江苏省南京市75号车库', 46, 36, 11.6),
(76, 32.0051, 118.749, '江苏省南京市76号车库', 47, 37, 11.7),
(77, 32.0149, 118.851, '江苏省南京市77号车库', 48, 38, 11.8),
(78, 32.0228, 118.809, '江苏省南京市78号车库', 49, 39, 11.9),
(79, 32.0081, 118.842, '江苏省南京市79号车库', 50, 40, 12),
(80, 32.0086, 118.749, '江苏省南京市80号车库', 51, 41, 12.1),
(81, 32.0165, 118.828, '江苏省南京市81号车库', 52, 42, 12.2),
(82, 32.0271, 118.839, '江苏省南京市82号车库', 53, 43, 12.3),
(83, 32.0275, 118.815, '江苏省南京市83号车库', 54, 44, 12.4),
(84, 32.0366, 118.85, '江苏省南京市84号车库', 55, 45, 12.5),
(85, 32.0253, 118.783, '江苏省南京市85号车库', 56, 46, 12.6),
(86, 32.0126, 118.747, '江苏省南京市86号车库', 57, 47, 12.7),
(87, 32.0125, 118.834, '江苏省南京市87号车库', 58, 48, 12.8),
(88, 32.0308, 118.839, '江苏省南京市88号车库', 59, 49, 12.9),
(89, 32.0268, 118.803, '江苏省南京市89号车库', 60, 50, 13),
(90, 32.0105, 118.773, '江苏省南京市90号车库', 61, 51, 13.1),
(91, 32.0268, 118.812, '江苏省南京市91号车库', 62, 52, 13.2),
(92, 32.025, 118.777, '江苏省南京市92号车库', 63, 53, 13.3),
(93, 32.0052, 118.828, '江苏省南京市93号车库', 64, 54, 13.4),
(94, 32.0088, 118.841, '江苏省南京市94号车库', 65, 55, 13.5),
(95, 32.0041, 118.791, '江苏省南京市95号车库', 66, 56, 13.6),
(96, 32.0338, 118.768, '江苏省南京市96号车库', 67, 57, 13.7),
(97, 32.0088, 118.808, '江苏省南京市97号车库', 68, 58, 13.8),
(98, 32.0223, 118.838, '江苏省南京市98号车库', 69, 59, 13.9),
(99, 32.0323, 118.761, '江苏省南京市99号车库', 70, 60, 14),
(100, 32.0226, 118.758, '江苏省南京市100号车库', 71, 61, 14.1),
(101, 32.028, 118.803, '江苏省南京市101号车库', 72, 62, 14.2),
(102, 32.0041, 118.815, '江苏省南京市102号车库', 73, 63, 14.3),
(103, 32.0291, 118.763, '江苏省南京市103号车库', 74, 64, 14.4),
(104, 32.0358, 118.767, '江苏省南京市104号车库', 75, 65, 14.5),
(105, 32.0022, 118.813, '江苏省南京市105号车库', 76, 66, 14.6),
(106, 32.0359, 118.816, '江苏省南京市106号车库', 77, 67, 14.7),
(107, 32.0086, 118.793, '江苏省南京市107号车库', 78, 68, 14.8),
(108, 32.0112, 118.852, '江苏省南京市108号车库', 79, 69, 14.9),
(109, 32.0061, 118.815, '江苏省南京市59号车库', 30, 20, 10),
(110, 32.0227, 118.839, '江苏省南京市60号车库', 31, 21, 10.1),
(111, 32.0063, 118.848, '江苏省南京市61号车库', 32, 22, 10.2),
(112, 32.0281, 118.82, '江苏省南京市62号车库', 33, 23, 10.3),
(113, 32.0109, 118.808, '江苏省南京市63号车库', 34, 24, 10.4),
(114, 32.0252, 118.747, '江苏省南京市64号车库', 35, 25, 10.5),
(115, 32.0038, 118.837, '江苏省南京市65号车库', 36, 26, 10.6),
(116, 32.0266, 118.767, '江苏省南京市66号车库', 37, 27, 10.7),
(117, 32.0077, 118.824, '江苏省南京市67号车库', 38, 28, 10.8),
(118, 32.0254, 118.804, '江苏省南京市68号车库', 39, 29, 10.9),
(119, 32.0288, 118.76, '江苏省南京市69号车库', 40, 30, 11),
(120, 32.0131, 118.758, '江苏省南京市70号车库', 41, 31, 11.1),
(121, 32.0101, 118.821, '江苏省南京市71号车库', 42, 32, 11.2),
(122, 32.0154, 118.828, '江苏省南京市72号车库', 43, 33, 11.3),
(123, 32.0255, 118.784, '江苏省南京市73号车库', 44, 34, 11.4),
(124, 32.0306, 118.808, '江苏省南京市74号车库', 45, 35, 11.5),
(125, 32.0345, 118.766, '江苏省南京市75号车库', 46, 36, 11.6),
(126, 32.0168, 118.848, '江苏省南京市76号车库', 47, 37, 11.7),
(127, 32.0205, 118.828, '江苏省南京市77号车库', 48, 38, 11.8),
(128, 32.0324, 118.746, '江苏省南京市78号车库', 49, 38, 11.9),
(129, 32.0195, 118.819, '江苏省南京市79号车库', 50, 40, 12),
(130, 32.0293, 118.801, '江苏省南京市80号车库', 51, 41, 12.1),
(131, 32.019, 118.795, '江苏省南京市81号车库', 52, 42, 12.2),
(132, 32.0089, 118.824, '江苏省南京市82号车库', 53, 43, 12.3),
(133, 32.002, 118.818, '江苏省南京市83号车库', 54, 44, 12.4),
(134, 32.0191, 118.772, '江苏省南京市84号车库', 55, 45, 12.5),
(135, 32.0011, 118.798, '江苏省南京市85号车库', 56, 46, 12.6),
(136, 32.0097, 118.784, '江苏省南京市86号车库', 57, 47, 12.7),
(137, 32.0088, 118.818, '江苏省南京市87号车库', 58, 48, 12.8),
(138, 32.0231, 118.779, '江苏省南京市88号车库', 59, 49, 12.9),
(139, 32.0201, 118.769, '江苏省南京市89号车库', 60, 50, 13),
(140, 32.0098, 118.835, '江苏省南京市90号车库', 61, 51, 13.1),
(141, 32.034, 118.83, '江苏省南京市91号车库', 62, 52, 13.2),
(142, 32.0271, 118.793, '江苏省南京市92号车库', 63, 53, 13.3),
(143, 32.0299, 118.848, '江苏省南京市93号车库', 64, 54, 13.4),
(144, 32.027, 118.765, '江苏省南京市94号车库', 65, 55, 13.5),
(145, 32.0168, 118.804, '江苏省南京市95号车库', 66, 56, 13.6),
(146, 32.0287, 118.766, '江苏省南京市96号车库', 67, 57, 13.7),
(147, 32.024, 118.76, '江苏省南京市97号车库', 68, 58, 13.8),
(148, 32.0017, 118.761, '江苏省南京市98号车库', 69, 59, 13.9),
(149, 32.0079, 118.786, '江苏省南京市99号车库', 70, 60, 14),
(150, 32.0097, 118.802, '江苏省南京市100号车库', 71, 61, 14.1),
(151, 32.0283, 118.82, '江苏省南京市101号车库', 72, 62, 14.2),
(152, 32.0036, 118.745, '江苏省南京市102号车库', 73, 63, 14.3),
(153, 32.0019, 118.781, '江苏省南京市103号车库', 74, 63, 14.4),
(154, 32.0114, 118.743, '江苏省南京市104号车库', 75, 65, 14.5),
(155, 32.0043, 118.853, '江苏省南京市105号车库', 76, 66, 14.6),
(156, 32.0116, 118.776, '江苏省南京市106号车库', 77, 67, 14.7),
(157, 32.0318, 118.801, '江苏省南京市107号车库', 78, 68, 14.8),
(158, 32.0125, 118.776, '江苏省南京市108号车库', 79, 71, 14.9);

-- --------------------------------------------------------

--
-- 表的结构 `garage_manager`
--

CREATE TABLE IF NOT EXISTS `garage_manager` (
`id` int(11) NOT NULL,
  `username` varchar(64) COLLATE utf8_bin NOT NULL,
  `password` varchar(128) COLLATE utf8_bin NOT NULL,
  `salt` varchar(32) COLLATE utf8_bin NOT NULL,
  `authority` int(10) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `garage_manager`
--

INSERT INTO `garage_manager` (`id`, `username`, `password`, `salt`, `authority`) VALUES
(1, 'admin', 'B9A040999507FDAA484F96F44852042B', '49be7', 0),
(2, 'lifan', '71CD0C2BD94DED16C8E46982E1E11D28', '44a58', 1),
(3, 'zhangsan', 'CDD91045DB75C3281E73A48307CF51A9', '90983', 2),
(4, 'lisi', '0727E2A4CC5C7DC8F840E29F744DA07D', 'a499e', 3),
(5, 'wangwu', '80754E300E45208539A379CAA1AA6A5B', '9ac4b', 4),
(6, 'liu', 'F58098954A8A48654A009D40BE5747D1', 'a822e', -1),
(7, 'wan', '80754E300E45208539A379CAA1AA6A5B', '9ac4b', -1),
(8, 'fan', '80754E300E45208539A379CAA1AA6A5B', '9ac4b', -1),
(9, 'li', '8815AF10B45BE2B2B40DD567EE8D0823', '764d5', -1),
(10, 'user1', '1B5BF0DB4193214FE45E014B0D91DBBF', '9bb08', -1);

-- --------------------------------------------------------

--
-- 表的结构 `history_solution`
--

CREATE TABLE IF NOT EXISTS `history_solution` (
`id` int(10) NOT NULL,
  `garage_id` int(10) NOT NULL,
  `fault_type` varchar(10) COLLATE utf8_bin NOT NULL,
  `fault_content` varchar(20) COLLATE utf8_bin NOT NULL,
  `deal_time` datetime NOT NULL,
  `deal_manager` varchar(20) COLLATE utf8_bin NOT NULL,
  `solution` varchar(100) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=3 ;

--
-- 转存表中的数据 `history_solution`
--

INSERT INTO `history_solution` (`id`, `garage_id`, `fault_type`, `fault_content`, `deal_time`, `deal_manager`, `solution`) VALUES
(1, 1, '急停报警', '车库运行中发生急停', '2018-10-01 09:17:18', 'admin', '检查车库电机运行状况和钢丝绳情况'),
(2, 1, '防松链报警', '车库停车完毕后钢丝绳突然松动', '2018-10-02 09:17:18', 'admin', '检查限位传感器的状态和钢丝绳是否老旧该更换');

-- --------------------------------------------------------

--
-- 表的结构 `late_order`
--

CREATE TABLE IF NOT EXISTS `late_order` (
`id` int(11) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `car_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `action_time` varchar(20) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `cancel_time` varchar(20) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `order_time` varchar(20) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `start_time` varchar(20) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `money` float NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `late_order`
--

INSERT INTO `late_order` (`id`, `username`, `car_num`, `action_time`, `cancel_time`, `order_time`, `start_time`, `money`) VALUES
(1, '18362903376', '沪F00001', '2018-09-10 20:02', '2018-09-24 14:53', '2018-09-10 20:40', '0', 0.01),
(4, '15161998449', '苏E290D0', '2018-10-01 16:33', '0', '2018-10-01 16:47', '0', 0.01);

-- --------------------------------------------------------

--
-- 表的结构 `life_manage`
--

CREATE TABLE IF NOT EXISTS `life_manage` (
`id` int(10) NOT NULL,
  `garage_id` int(10) NOT NULL,
  `address` varchar(20) COLLATE utf8_bin NOT NULL,
  `start_time` datetime NOT NULL,
  `end_time` datetime DEFAULT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=4 ;

--
-- 转存表中的数据 `life_manage`
--

INSERT INTO `life_manage` (`id`, `garage_id`, `address`, `start_time`, `end_time`) VALUES
(1, 1, '江苏省南京市1号车库', '2018-06-01 00:00:00', NULL),
(2, 2, '江苏省南京市2号车库', '2018-06-01 00:00:00', NULL),
(3, 3, '江苏省南京市3号车库', '2018-06-01 00:00:00', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `login_ticket`
--

CREATE TABLE IF NOT EXISTS `login_ticket` (
`id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `ticket` varchar(45) NOT NULL,
  `expired` datetime NOT NULL,
  `status` int(11) DEFAULT '0'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=185 ;

--
-- 转存表中的数据 `login_ticket`
--

INSERT INTO `login_ticket` (`id`, `user_id`, `ticket`, `expired`, `status`) VALUES
(40, 2, '3f72bafcefa1444c84c7c67de3b9e3fe', '2018-08-07 16:43:14', 1),
(41, 2, '6c8b3c14297746e297a9ac94392a2546', '2018-08-07 16:43:45', 1),
(42, 1, 'b50f9f4f929749f4b0a5f5133567d455', '2018-08-07 16:46:49', 1),
(43, 2, 'f258524e9a1c43ee86c2270dc2ebf62b', '2018-08-07 16:47:08', 0),
(44, 2, '8e71636fd1f048c2ad3b66d627001f37', '2018-08-07 16:50:10', 1),
(45, 2, 'acdb619843274298a28847e1abbc00d3', '2018-08-06 16:50:20', 0),
(46, 2, 'e7611225f7d84eab92e08008ffd99bdc', '2018-08-07 16:55:48', 1),
(47, 1, 'ffea502a4f3049babda754f348b8fb66', '2018-08-07 16:57:45', 1),
(48, 2, '788dbd36d4754484a1ef9f4a59df8ca6', '2018-08-07 17:11:02', 1),
(49, 1, '9d904e82c40349888c3c33d264e4e2eb', '2018-08-07 17:11:07', 1),
(50, 2, '10d36bd900b344a3a301987e50c395b0', '2018-08-07 17:21:51', 1),
(51, 2, '8b8b192a411e4996bbb531cffb8419d1', '2018-08-07 17:21:54', 0),
(52, 2, '5715fe858c0b4f08a693ce8680a26252', '2018-08-08 19:51:07', 0),
(53, 2, 'f5ed9dd2ef724982bce8fef700cdd88f', '2018-08-08 19:53:20', 0),
(54, 2, 'f306ff1845314ea9a1dbe1126572261f', '2018-08-09 14:17:57', 0),
(55, 2, '64d692331675444a80c21a60f19e8a92', '2018-08-09 14:34:50', 0),
(56, 2, '16ed8a239b7c47d994d8b03f5d83162f', '2018-08-13 12:56:21', 0),
(57, 1, 'd41bb213061d450296864b6414214af2', '2018-08-13 12:56:35', 1),
(58, 1, '265f5f3527844dda8c6cc1eec7850690', '2018-08-13 12:56:48', 1),
(59, 2, 'b1cf2d7e333445ffa3d1c2144f095bdf', '2018-08-13 15:12:41', 1),
(60, 2, '8b664a73b4e6458abf90285277f0f8aa', '2018-08-14 13:48:20', 1),
(61, 1, '3529105cfa774b02b7ac6a936b632af1', '2018-08-14 15:34:55', 0),
(62, 1, '480b07296b424e0cb3f038dfaf3cd520', '2018-08-17 13:13:06', 0),
(63, 1, '3fe902ca15d44910850397ff4ebdf269', '2018-08-17 16:31:15', 0),
(64, 1, '4769a59bbb344acd94de9f1662674e84', '2018-08-17 17:03:48', 0),
(65, 1, '4d61bb9ce5114f688145a20c382e55f0', '2018-09-01 20:30:07', 0),
(66, 2, 'e46ad8e1102d40c9b72b47a9a93ecc47', '2018-09-02 12:11:37', 0),
(67, 2, '9060aab33f774ebaaa130ed1eb9f91df', '2018-09-09 12:03:20', 0),
(68, 2, '97f1134f1bda4ebaa4efa1cfbf561f38', '2018-09-09 17:03:20', 0),
(69, 1, 'd785869a7b4649a1953ede9adb811647', '2018-09-09 17:04:23', 0),
(70, 2, 'a2cfb5a61a6a472583a209d7241ae49d', '2018-09-09 17:04:49', 0),
(71, 2, 'f0a3be4b5b824179a5a543351289f935', '2018-09-09 17:05:02', 0),
(72, 2, '1180442470f64852a0826f34c563d084', '2018-09-09 20:15:13', 0),
(73, 2, '346d749ba1584cc0986ef0e9c41b7696', '2018-09-10 12:35:14', 0),
(74, 1, '6eb84231ff784e0db380e701a3e14eb9', '2018-09-10 13:52:43', 0),
(75, 2, '404b53830e6d45d7af1e166cd4f477f4', '2018-09-10 14:27:19', 0),
(76, 2, '0213bb992d8943d9b9cfed8acdf2157a', '2018-09-10 14:27:41', 0),
(77, 2, '1a4b41849408462594346309580f1748', '2018-09-10 16:40:37', 1),
(78, 2, 'f698e22b8c4f4b5e932e65fc664ead1e', '2018-09-10 17:06:12', 0),
(79, 1, 'f2b479e5e96e4c179ef032d7d265199c', '2018-09-15 11:03:31', 0),
(80, 2, 'b6cccc45f2674ca18ce6136653ac9cd1', '2018-09-15 13:39:57', 0),
(81, 2, '92147cc4884a42b4acbabdf599751544', '2018-09-15 13:40:17', 1),
(82, 4, '8893093ff0cf47219e2344f896076699', '2018-09-15 15:23:36', 0),
(83, 6, 'b23f93bf0f274a2bb3b959e6fab92e95', '2018-09-16 18:04:24', 0),
(84, 6, 'a8523dd10ea04008814d177ff0d4904d', '2018-09-17 21:04:13', 0),
(85, 5, 'c1c6af06684849348ea13004f9025a92', '2018-09-18 13:34:11', 0),
(86, 5, 'ea40b5dd83de44a389bee80a10e7f1bd', '2018-09-18 13:35:46', 0),
(87, 5, '069cffaaaac84cbcb7638696182aef4a', '2018-09-18 13:44:53', 1),
(88, 5, '9f56b14fd8264c69ade337b36c0a5fe2', '2018-09-18 13:47:39', 0),
(89, 5, '41d57ef4e19c4656ae931faf880769fd', '2018-09-18 13:51:44', 0),
(90, 5, '22d0495398034f568c78fe2abbafddb3', '2018-09-18 13:55:17', 0),
(91, 5, '73fc426b9e014f52807268c4144db5c1', '2018-09-20 13:37:12', 0),
(92, 5, '93ef3a607fe64f7eb137baf377288e63', '2018-09-20 16:08:27', 0),
(93, 5, '5f8bade26f894e5c93ae004993e330b8', '2018-09-25 12:40:01', 0),
(94, 5, '765562ed6faa420082ad45df638d609d', '2018-09-26 12:39:10', 1),
(95, 5, 'c684e3ca97e249739065c62ad46ffe55', '2018-09-26 13:36:59', 0),
(96, 5, 'd9729d7a1a394ac0a86651abd3e7fcbd', '2018-09-27 10:46:14', 0),
(97, 5, '006a76ea86684f4c899141d9083a28ad', '2018-09-28 10:48:58', 0),
(98, 5, 'dff50e0e492f4099b7a553319f5b0be2', '2018-09-29 21:36:25', 0),
(99, 5, '6782ebca68844ffa9c34d89a400b6349', '2018-10-01 10:47:38', 1),
(100, 10, '56a0a0a54ceb4243bd822c94547abc3a', '2018-10-01 10:48:08', 1),
(101, 11, 'e44b02fb38034c20a6213c6db8b4bf9a', '2018-10-01 10:56:37', 0),
(102, 10, '7079756d31bc45708e65ae340b2d0e23', '2018-10-06 19:14:55', 1),
(103, 10, '9326e0665f02488488758c2ba22dafcf', '2018-10-08 14:31:19', 1),
(104, 11, '450ce5c081624edeac370d7f9cb9d367', '2018-10-08 17:06:39', 1),
(105, 10, '5e07fc73cfa44f8b8e3a6e2124b297a3', '2018-10-08 17:07:14', 1),
(106, 10, '8955b7e404a1404f98bebf7c005079e8', '2018-10-09 12:58:40', 0),
(107, 10, 'd5d0490f3dba44b8843b7f68b5db8751', '2018-10-10 20:53:29', 0),
(108, 10, '5150457ec9cf4aed853bbfce0caa77ce', '2018-10-11 20:10:06', 0),
(109, 10, '4921def71d5d497a911fdeda11b5c4c4', '2018-10-13 10:58:49', 0),
(110, 10, 'c708768866864a529b0b1f36270f2b24', '2018-10-13 20:04:28', 0),
(111, 10, '6a564172be3c46bfbad71ccc46c339cb', '2018-10-14 10:17:03', 0),
(112, 10, '0c5d6f85a6ef4eb1bd35dd7d8728fb90', '2018-10-14 10:19:58', 0),
(113, 10, '7d112b062d274885aeacdcd4b88e2399', '2018-10-14 11:17:52', 0),
(114, 10, '05b6fbc36509438e85ad610656a8e3ea', '2018-10-14 12:00:01', 0),
(115, 10, 'c35c76b19e7d4b479b9b38a11838de34', '2018-10-14 12:31:33', 0),
(116, 10, '456012a57c7c48b19e1602ac7830de06', '2018-10-14 12:31:33', 0),
(117, 10, 'e2a277b8e6924a1694afc81864cd1099', '2018-10-14 12:35:54', 0),
(118, 10, 'db2fbf11d56f4123a13484ced3a6f2ff', '2018-10-14 12:40:47', 0),
(119, 10, '50e15669411a4dc3b13923732dc022b6', '2018-10-14 12:41:06', 0),
(120, 10, '76c9468a30aa48dfb0d5ab7ef08c76ff', '2018-10-14 12:57:22', 0),
(121, 10, '956991b61758459a8375719d041854cf', '2018-10-14 14:17:05', 0),
(122, 10, '118f9097c4c34b4fa542b0385fc9b8f0', '2018-10-15 08:28:16', 0),
(123, 10, '42ce9ffd110b487d90dbda0cf445e993', '2018-10-16 15:18:38', 1),
(124, 12, 'bba532cf810146669ed5b812f0a6f0b7', '2018-10-16 15:19:39', 1),
(125, 10, '7b0839c764944b24ac13e83b8b49f2d6', '2018-10-16 15:38:01', 0),
(126, 10, '19cb9bdc37b649ba8d519dd5ddf35032', '2018-10-17 12:32:33', 0),
(127, 10, 'ddd87b1eadab4300bd7da80063923341', '2018-10-17 14:09:16', 0),
(128, 10, '7d8b05085b2f4d0aaf3989c7afb92fa6', '2018-10-19 08:07:09', 0),
(129, 10, 'cd0d29b90fd34d05b527e1e54ecc524c', '2018-10-19 20:23:29', 1),
(130, 10, 'eef66d6e2a4142b0a88fa524dbae07cb', '2018-10-20 18:18:09', 0),
(131, 10, '7adc7506209e498fb05c238c36ab8d52', '2018-10-24 00:01:59', 0),
(132, 10, 'f745e52867fa4c85b344ece947d0e103', '2018-10-24 18:57:40', 0),
(133, 10, 'bd68198c6324409597ec44eba0a25cd2', '2018-10-25 15:19:05', 0),
(134, 10, '8cb35df89d044e64b2688122fdf95e29', '2018-10-25 15:23:37', 0),
(135, 10, '431810f877ba4273beeb7f0c1c5bdf7d', '2018-10-31 19:09:33', 1),
(136, 11, 'dae8ea8505fa47ff954039cb9cd94075', '2018-10-31 19:13:38', 1),
(137, 10, 'cc2bceaef81540f9850b53c2c51f113e', '2018-10-31 19:14:04', 0),
(138, 10, '5b52455e55534d8ba5ddf9a3572418fe', '2018-10-31 21:33:35', 0),
(139, 10, '66b39d0363c844d59cf176cde1ae355b', '2018-11-01 07:56:31', 0),
(140, 10, 'e055c5471abb4d61b348e13528d9bac8', '2018-11-01 08:25:37', 0),
(141, 10, '1189d8c5f9c64006a82ee972f9fea553', '2018-11-01 08:26:56', 0),
(142, 10, '09cec5fc06d24f21a4dae87422f5d3cf', '2018-11-01 09:03:53', 0),
(143, 10, 'afd451d6a3fd42059e83eecbf6fd49c8', '2018-11-01 09:49:56', 0),
(144, 10, 'b2155b016eb94d01ba1d688b2b62f733', '2018-11-01 10:26:47', 0),
(145, 10, '782429f3404a42a5989ed003a154c1b1', '2018-11-04 17:22:13', 0),
(146, 10, '074e5ea9a99c40658e4c3d292355dfbc', '2018-11-05 16:21:36', 0),
(147, 10, 'bfa94f4e90b74e73b5a0c67b001f0d5a', '2018-11-05 16:42:46', 0),
(148, 10, '9acac4bbe47944f9a7829b0e52cb3689', '2018-11-16 11:24:07', 0),
(149, 10, '703a40d0a16b4183871f782dea8a8754', '2018-11-16 14:19:10', 1),
(150, 12, 'a24827580984411ca48a335a289bff16', '2018-11-16 14:51:41', 1),
(151, 10, 'c04412da4da44c84a7bff6819e8354d6', '2018-11-16 14:53:50', 0),
(152, 10, 'aee714ffe00a4236a176d4c330f3d403', '2018-11-20 15:11:50', 0),
(153, 10, 'aaefb539269043b18e6584a72f488435', '2018-12-04 15:54:50', 0),
(154, 10, '6c660eba1e424da98a96bfb115fd13d5', '2018-12-04 17:06:04', 0),
(155, 10, '0f956ca2cdcd48b79715af462895fae2', '2018-12-04 17:06:21', 1),
(156, 10, 'f73f4049deca4e8c96434be3aec747c6', '2018-12-04 17:10:08', 0),
(157, 10, '1cba5deec723429f952281bbfc49201a', '2018-12-04 17:10:25', 1),
(158, 12, '727b8b5f8b254aafb1a2af99fb92d5c1', '2018-12-04 17:11:05', 1),
(159, 10, 'c9173d16feb647a4a79857094cf9610e', '2018-12-04 17:11:27', 0),
(160, 10, '238bec7f94fe4b528ee8762ab4dcbf34', '2018-12-04 17:16:51', 1),
(161, 10, '08780f5d38ad457daef989890a059793', '2018-12-04 17:17:39', 0),
(162, 10, '7e437061ca1d4e6598957568ec058a73', '2018-12-04 17:21:10', 0),
(163, 10, 'c27c1d2e874042bb9118f96df0fa18be', '2018-12-06 10:39:39', 0),
(164, 10, '61c3b6d8f2b14e5490f312f576a36c23', '2018-12-06 14:09:17', 0),
(165, 10, '4ef1ba2b5f51479daf671f5d1373ed68', '2018-12-06 16:49:38', 0),
(166, 10, '3bfdf43902ed4eb4829c4b8a06d17107', '2018-12-06 16:53:43', 0),
(167, 10, 'c5178c9927f344df8f1bdf9ff326c08b', '2018-12-07 15:25:33', 0),
(168, 10, 'a8bae4e4e10f4cd7830e30110414c9cb', '2018-12-07 19:23:42', 0),
(169, 10, '7219dc314d8d4740bbad1c83b3feecfc', '2018-12-08 12:05:11', 1),
(170, 10, 'ab301b79762a4c05a368229d1ff8bc0b', '2018-12-08 19:00:54', 0),
(171, 10, 'cae07bdb2e3e46ef8ca939bc12f0cef5', '2018-12-09 14:09:14', 0),
(172, 10, '29c65ed6c5814c36b5e3df7b80855b44', '2018-12-11 07:53:04', 0),
(173, 10, '550b63c33c06427aa0d4ab4de5855f17', '2018-12-11 15:49:34', 0),
(174, 10, 'f1907890eda14d91af8d4e837b7c335e', '2018-12-15 10:37:53', 0),
(175, 10, '662e9ba0c5f4417cb787575dfee5604e', '2018-12-15 10:44:20', 0),
(176, 10, 'a55633b0e5454e729e43dc3b1b58e93f', '2018-12-16 16:05:43', 0),
(177, 10, '36758787eabb44fe8b5388405ddae2ae', '2018-12-16 16:09:34', 0),
(178, 10, 'b340071f0c4e47458891e11786ef77ab', '2018-12-16 16:16:56', 0),
(179, 10, '6927ce7d906347f483902c718b653390', '2018-12-18 10:33:00', 0),
(180, 10, 'ccb631fcf3dc4098ab417c48d32a270e', '2018-12-18 14:13:13', 0),
(181, 10, '589e226e9a1847b88c53c5ab81837c78', '2018-12-19 10:00:42', 0),
(182, 10, '2ecb17c1f2894fdc88dfb267bff3b457', '2018-12-20 10:22:49', 0),
(183, 10, 'a63bcc4381d24891a0d0cc649a602cb2', '2018-12-20 10:46:40', 0),
(184, 10, 'd487ec693a544a939bd6289b48a4f0b5', '2018-12-20 10:47:12', 0);

-- --------------------------------------------------------

--
-- 表的结构 `manager`
--

CREATE TABLE IF NOT EXISTS `manager` (
`id` int(11) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `manager`
--

INSERT INTO `manager` (`id`, `username`, `password`) VALUES
(1, 'admin', '123456');

-- --------------------------------------------------------

--
-- 表的结构 `member`
--

CREATE TABLE IF NOT EXISTS `member` (
`id` int(20) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `car_num` varchar(20) CHARACTER SET utf8 NOT NULL,
  `car_type` varchar(20) CHARACTER SET utf8 NOT NULL,
  `status` int(10) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=51 ;

--
-- 转存表中的数据 `member`
--

INSERT INTO `member` (`id`, `username`, `password`, `car_num`, `car_type`, `status`) VALUES
(1, '18959204245', '123456', '赣F16712', 'Aventador LP700-4', 1),
(26, '18795968928', '123456', '冀B88BB8', '白色保时捷', 1),
(27, '18362903376', '123456', '沪F00001', '黑色丰田', 1),
(28, '18036134694', '123456', '苏E9E5F9', '帕萨特', 1),
(29, '15062223700', '1294228806', 'è‹J@1234567', 'car', 1),
(30, '17621315185', '123456', 'xj615', 'xrv', 1),
(33, 'm1', '123', '0', '0', 1),
(34, 'm2', '123', '0', '0', 2),
(35, 'm3', '123', '0', '0', 3),
(36, 'm4', '123', '0', '0', 4),
(37, '17625312122', '17625312122', '苏E88888', '保时捷', 1),
(38, '13776149747', '123456', '苏E892P6', '轿车', 1),
(39, '18752980500', '123456', '苏EP95C7', '轿车', 1),
(40, '18913082540', 'zzj123', '苏E60NH1', '轿车', 1),
(42, '18256019896', '12345678', '苏E88888', '保时捷卡宴', 1),
(43, '15161998449', '123456', '苏E290D0', '尼桑', 1),
(44, '13771695481', '123456', '苏E12345', '大众', 1),
(45, '18862320893', '123456', '苏E56489', '大众', 1),
(46, '15195890986', '123456', '京PD7459', '黑色丰田', 1),
(47, '13771643855', 'adcolour', '苏E1R9J8', '别克', 1),
(48, '17768105856', '123456', '123', '123', 1),
(49, '15950563836', '123456', '123', 'qwe', 1),
(50, '', '', '', '', 1);

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
`id` int(11) NOT NULL,
  `from_id` int(11) DEFAULT NULL,
  `to_id` int(11) DEFAULT NULL,
  `content` text,
  `created_date` datetime DEFAULT NULL,
  `has_read` int(11) DEFAULT NULL,
  `conversation_id` varchar(45) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=72 ;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`id`, `from_id`, `to_id`, `content`, `created_date`, `has_read`, `conversation_id`) VALUES
(1, 10, 10, '梵蒂冈梵蒂冈丰东股份', '2018-10-18 13:45:01', 1, '10_10'),
(2, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:45:19', 1, '1_10'),
(3, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:47:47', 1, '1_10'),
(4, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:03', 1, '1_10'),
(5, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:04', 1, '1_10'),
(6, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:05', 1, '1_10'),
(7, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:06', 1, '1_10'),
(8, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:08', 1, '1_10'),
(9, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:09', 1, '1_10'),
(10, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:10', 1, '1_10'),
(11, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:12', 1, '1_10'),
(12, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:14', 1, '1_10'),
(13, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 13:54:16', 1, '1_10'),
(14, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:12:14', 0, '1_10'),
(15, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:12:15', 0, '1_10'),
(16, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:12:16', 0, '1_10'),
(17, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:40:30', 0, '1_10'),
(18, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:40:31', 0, '1_10'),
(19, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:41:44', 0, '1_10'),
(20, 1, 10, '用户user1赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-10-18 14:48:49', 0, '1_10'),
(21, 1, 1, '用户admin赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-11-07 15:55:31', 0, '1_1'),
(22, 1, 1, '用户admin赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-11-07 16:01:01', 0, '1_1'),
(23, 1, 2, '用户admin回复了你', '2018-11-07 16:17:35', 0, '1_2'),
(24, 4, 12, '用户USER9关注了你,http://127.0.0.1:8080/user/10', '2018-11-29 17:07:27', 0, '4_12'),
(25, 1, 12, '用户fan赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-12-02 17:12:44', 0, '1_12'),
(26, 1, 12, '用户fan赞了你的评论,http://127.0.0.1:8080/center_my_index.html', '2018-12-02 17:12:46', 0, '1_12'),
(27, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:33:56', 0, '1_8'),
(28, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:00', 1, '1_8'),
(29, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:06', 1, '1_8'),
(30, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:16', 1, '1_8'),
(31, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:17', 1, '1_8'),
(32, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:18', 1, '1_8'),
(33, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:19', 1, '1_8'),
(34, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 19:34:19', 1, '1_8'),
(35, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 19:34:30', 1, '1_9'),
(36, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 19:36:15', 1, '1_9'),
(37, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 19:36:36', 1, '1_9'),
(38, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:30:07', 1, '1_9'),
(39, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:30:18', 1, '1_9'),
(40, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:30:23', 1, '1_9'),
(41, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:30:34', 1, '1_9'),
(42, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:30:34', 1, '1_9'),
(43, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:31:38', 1, '1_9'),
(44, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:31:39', 1, '1_9'),
(45, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:34:56', 1, '1_9'),
(46, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:34:58', 1, '1_9'),
(47, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:34:59', 1, '1_9'),
(48, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:34:59', 1, '1_9'),
(49, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:54:52', 1, '1_9'),
(50, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:54:59', 1, '1_9'),
(51, 1, 9, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 20:54:59', 1, '1_9'),
(52, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:02:50', 1, '1_8'),
(53, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:07:18', 1, '1_8'),
(54, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:07:23', 1, '1_8'),
(55, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:01', 1, '1_8'),
(56, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:03', 1, '1_8'),
(57, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:04', 1, '1_8'),
(58, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:05', 1, '1_8'),
(59, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:06', 1, '1_8'),
(60, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:09:21', 1, '1_8'),
(61, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:10:35', 1, '1_8'),
(62, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:11:03', 1, '1_8'),
(63, 1, 8, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-02 21:14:19', 1, '1_8'),
(65, 1, 8, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 21:55:49', 1, '1_8'),
(66, 1, 6, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 21:56:41', 0, '1_6'),
(67, 1, 10, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-02 21:58:03', 0, '1_10'),
(69, 1, 8, '用户li关注了你,http://127.0.0.1:8080/user/9', '2018-12-03 13:45:47', 0, '1_8'),
(70, 1, 9, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-03 13:46:04', 1, '1_9'),
(71, 1, 7, '用户fan关注了你,http://127.0.0.1:8080/user/8', '2018-12-03 14:33:01', 0, '1_7');

-- --------------------------------------------------------

--
-- 表的结构 `no1_car_place`
--

CREATE TABLE IF NOT EXISTS `no1_car_place` (
`id` int(20) NOT NULL,
  `cp_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `fall_io_point` varchar(10) COLLATE utf8_bin NOT NULL,
  `status` int(20) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `no1_car_place`
--

INSERT INTO `no1_car_place` (`id`, `cp_num`, `fall_io_point`, `status`) VALUES
(1, '101', '0', 1),
(2, '102', '0', 1),
(3, '201', '1', 0),
(4, '202', '2', 1),
(5, '301', '3', 0),
(6, '302', '4', 1),
(7, '401', '5', 1),
(8, '402', '6', 0),
(9, '501', '7', 0),
(10, '502', '8', 1),
(11, '601', '9', 1),
(12, '602', '10', 0),
(13, '603', '11', 1);

-- --------------------------------------------------------

--
-- 表的结构 `no1_floor_1`
--

CREATE TABLE IF NOT EXISTS `no1_floor_1` (
`id` int(10) NOT NULL,
  `high_floor_cp_num` varchar(10) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `no1_floor_1`
--

INSERT INTO `no1_floor_1` (`id`, `high_floor_cp_num`) VALUES
(1, '201');

-- --------------------------------------------------------

--
-- 表的结构 `order_info`
--

CREATE TABLE IF NOT EXISTS `order_info` (
`order_id` int(10) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `car_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `garage_num` int(11) NOT NULL,
  `action_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `start_time` varchar(20) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=371 ;

-- --------------------------------------------------------

--
-- 表的结构 `parking_history`
--

CREATE TABLE IF NOT EXISTS `parking_history` (
`parking_id` int(20) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `car_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `garage_num` int(20) NOT NULL,
  `cp_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `start_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `leave_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `money` float NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=392 ;

--
-- 转存表中的数据 `parking_history`
--

INSERT INTO `parking_history` (`parking_id`, `username`, `car_num`, `garage_num`, `cp_num`, `start_time`, `leave_time`, `money`) VALUES
(2, '18959204245', '赣F16712', 1, '101', '2018-11-05 21:42', '2018-11-15 14:55', 0.01),
(3, '18959204245', '粤CKC236', 1, '101', '2018-08-22 09:21', '2018-08-24 10:04', 0.01),
(4, '18036134694', '苏E9E5F9', 1, '301', '2018-10-15 14:13', '2018-10-15 14:15', 0.01),
(5, '18959204245', '苏E9E5F9', 2, '101', '2018-11-23 16:57', '2018-11-23 17:00', 0.01),
(6, '18036134694', '苏E9E5F9', 1, '301', '2018-11-30 08:13', '2018-12-01 07:48', 0.01),
(7, '18036134694', '苏E9E5F9', 1, '201', '2018-12-08 07:47', '2018-12-08 16:37', 0.01),
(391, '18959204245', '粤CKC236', 1, '101', '2018-08-24 10:39', '2018-08-24 10:04', 0.05);

-- --------------------------------------------------------

--
-- 表的结构 `parking_info`
--

CREATE TABLE IF NOT EXISTS `parking_info` (
`parking_id` int(20) NOT NULL,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `car_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `garage_num` int(20) NOT NULL,
  `cp_num` varchar(20) COLLATE utf8_bin NOT NULL,
  `finish_parking` int(10) NOT NULL,
  `confirm_parking` int(10) NOT NULL,
  `action_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `order_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `start_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `leave_time` varchar(20) COLLATE utf8_bin NOT NULL,
  `money` float NOT NULL,
  `pay_status` int(20) NOT NULL,
  `confirm_out` int(10) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=8 ;

-- --------------------------------------------------------

--
-- 表的结构 `problem`
--

CREATE TABLE IF NOT EXISTS `problem` (
`id` int(11) NOT NULL,
  `garage_id` int(10) NOT NULL,
  `title` varchar(255) COLLATE utf8_bin NOT NULL,
  `content` text COLLATE utf8_bin,
  `username` varchar(20) COLLATE utf8_bin NOT NULL,
  `created_date` datetime NOT NULL,
  `status` varchar(10) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=29 ;

--
-- 转存表中的数据 `problem`
--

INSERT INTO `problem` (`id`, `garage_id`, `title`, `content`, `username`, `created_date`, `status`) VALUES
(26, 3, '急停开关故障', '急停开关按钮不灵敏', 'lifan', '2018-09-20 13:00:07', '已受理'),
(27, 1, '光电报警装置故障', '光电报警装置故障', 'admin', '2018-09-27 13:50:30', '已解决'),
(28, 3, 'fdsaf', 'dsfdsf', 'admin', '2018-10-30 19:15:49', '已受理');

-- --------------------------------------------------------

--
-- 表的结构 `reply`
--

CREATE TABLE IF NOT EXISTS `reply` (
`id` int(11) NOT NULL,
  `manager` varchar(20) NOT NULL,
  `authority` int(10) NOT NULL,
  `to_name` varchar(20) NOT NULL,
  `question_id` int(11) NOT NULL,
  `content` text NOT NULL,
  `created_date` datetime NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=29 ;

--
-- 转存表中的数据 `reply`
--

INSERT INTO `reply` (`id`, `manager`, `authority`, `to_name`, `question_id`, `content`, `created_date`, `status`) VALUES
(19, 'admin', 0, 'lifan', 26, '今天是你的生日', '2018-09-26 15:55:40', 1),
(22, 'lifan', 1, 'admin', 26, '好的谢谢啊', '2018-09-26 16:04:14', 1),
(23, 'admin', 0, 'lifan', 26, '会差行号', '2018-09-26 16:52:20', 1),
(24, 'admin', 0, 'lifan', 26, '都是法师打发第三方', '2018-09-26 16:58:17', 1),
(25, 'admin', 0, 'admin', 29, '非官方大哥法规', '2018-09-27 20:10:16', 1),
(26, 'admin', 0, 'admin', 27, 'erwferf', '2018-10-18 20:23:55', 1),
(27, 'admin', 0, 'admin', 28, 'edffdsafgdsafds', '2018-10-30 19:16:03', 1),
(28, 'admin', 0, 'admin', 28, '范德萨发生大发送到', '2018-11-15 14:54:03', 1);

-- --------------------------------------------------------

--
-- 表的结构 `running_data`
--

CREATE TABLE IF NOT EXISTS `running_data` (
`id` int(10) NOT NULL,
  `status` int(10) NOT NULL,
  `left_w` float NOT NULL,
  `left_n` float NOT NULL,
  `left_i` float NOT NULL,
  `right_w` float NOT NULL,
  `right_n` float NOT NULL,
  `right_i` int(11) NOT NULL,
  `horizontal_w` float NOT NULL,
  `horizontal_n` float NOT NULL,
  `horizontal_i` float NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=6 ;

--
-- 转存表中的数据 `running_data`
--

INSERT INTO `running_data` (`id`, `status`, `left_w`, `left_n`, `left_i`, `right_w`, `right_n`, `right_i`, `horizontal_w`, `horizontal_n`, `horizontal_i`) VALUES
(1, 1, 2200, 42, 5.6, 3700, 42, 8, 200, 40, 0.75),
(2, 0, 2112, 39, 5.72, 3771, 38, 8, 208, 37, 0.71),
(3, -1, 2166, 28, 5.56, 3624, 43, 8, 204, 35, 0.72),
(4, 0, 2182, 40, 5.47, 3714, 37, 8, 213, 36, 0.79),
(5, 0, 2182, 40, 5.47, 3714, 37, 8, 213, 42, 0.79);

-- --------------------------------------------------------

--
-- 表的结构 `screen_status`
--

CREATE TABLE IF NOT EXISTS `screen_status` (
`id` int(10) NOT NULL,
  `status` int(1) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `screen_status`
--

INSERT INTO `screen_status` (`id`, `status`) VALUES
(1, 1);

-- --------------------------------------------------------

--
-- 表的结构 `solutions`
--

CREATE TABLE IF NOT EXISTS `solutions` (
`id` int(10) NOT NULL,
  `fault_code` int(10) NOT NULL,
  `deal_time` datetime NOT NULL,
  `deal_manager` varchar(20) COLLATE utf8_bin NOT NULL,
  `solution` varchar(100) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
`id` int(11) unsigned NOT NULL,
  `name` varchar(64) NOT NULL DEFAULT '',
  `password` varchar(128) NOT NULL DEFAULT '',
  `salt` varchar(32) NOT NULL DEFAULT '',
  `head_url` varchar(256) NOT NULL DEFAULT ''
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `name`, `password`, `salt`, `head_url`) VALUES
(2, 'USER1', 'newpassword', '', 'http://images.nowcoder.com/head/147t.png'),
(3, 'USER2', 'newpassword', '', 'http://images.nowcoder.com/head/39t.png'),
(4, 'USER3', 'newpassword', '', 'http://images.nowcoder.com/head/426t.png'),
(5, 'USER4', 'newpassword', '', 'http://images.nowcoder.com/head/416t.png'),
(6, 'USER5', 'newpassword', '', 'http://images.nowcoder.com/head/318t.png'),
(7, 'USER6', 'newpassword', '', 'http://images.nowcoder.com/head/835t.png'),
(8, 'USER7', 'newpassword', '', 'http://images.nowcoder.com/head/666t.png'),
(9, 'USER8', 'newpassword', '', 'http://images.nowcoder.com/head/846t.png'),
(10, 'USER9', 'newpassword', '', 'http://images.nowcoder.com/head/209t.png'),
(11, 'USER10', 'newpassword', '', 'http://images.nowcoder.com/head/422t.png'),
(12, '123', '351058FB6E32289885917513ABB16092', 'bf38a', 'http://images.nowcoder.com/head/901t.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `all_garage_status`
--
ALTER TABLE `all_garage_status`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `back_danpianji`
--
ALTER TABLE `back_danpianji`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
 ADD PRIMARY KEY (`id`), ADD KEY `entity_index` (`entity_id`,`entity_type`);

--
-- Indexes for table `danpianji`
--
ALTER TABLE `danpianji`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `fault_history`
--
ALTER TABLE `fault_history`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `fault_warning`
--
ALTER TABLE `fault_warning`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `feed`
--
ALTER TABLE `feed`
 ADD PRIMARY KEY (`id`), ADD KEY `user_index` (`user_id`);

--
-- Indexes for table `garage_info`
--
ALTER TABLE `garage_info`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `garage_manager`
--
ALTER TABLE `garage_manager`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `history_solution`
--
ALTER TABLE `history_solution`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `late_order`
--
ALTER TABLE `late_order`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `life_manage`
--
ALTER TABLE `life_manage`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `login_ticket`
--
ALTER TABLE `login_ticket`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `ticket_UNIQUE` (`ticket`);

--
-- Indexes for table `manager`
--
ALTER TABLE `manager`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
 ADD PRIMARY KEY (`id`), ADD KEY `conversation_index` (`conversation_id`), ADD KEY `created_date` (`created_date`);

--
-- Indexes for table `no1_car_place`
--
ALTER TABLE `no1_car_place`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `no1_floor_1`
--
ALTER TABLE `no1_floor_1`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_info`
--
ALTER TABLE `order_info`
 ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `parking_history`
--
ALTER TABLE `parking_history`
 ADD PRIMARY KEY (`parking_id`);

--
-- Indexes for table `parking_info`
--
ALTER TABLE `parking_info`
 ADD PRIMARY KEY (`parking_id`);

--
-- Indexes for table `problem`
--
ALTER TABLE `problem`
 ADD PRIMARY KEY (`id`), ADD KEY `date_index` (`created_date`);

--
-- Indexes for table `reply`
--
ALTER TABLE `reply`
 ADD PRIMARY KEY (`id`), ADD KEY `entity_index` (`question_id`);

--
-- Indexes for table `running_data`
--
ALTER TABLE `running_data`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `screen_status`
--
ALTER TABLE `screen_status`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `solutions`
--
ALTER TABLE `solutions`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `all_garage_status`
--
ALTER TABLE `all_garage_status`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=27;
--
-- AUTO_INCREMENT for table `danpianji`
--
ALTER TABLE `danpianji`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `fault_history`
--
ALTER TABLE `fault_history`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `fault_warning`
--
ALTER TABLE `fault_warning`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `feed`
--
ALTER TABLE `feed`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `garage_info`
--
ALTER TABLE `garage_info`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=159;
--
-- AUTO_INCREMENT for table `garage_manager`
--
ALTER TABLE `garage_manager`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `history_solution`
--
ALTER TABLE `history_solution`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `late_order`
--
ALTER TABLE `late_order`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `life_manage`
--
ALTER TABLE `life_manage`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `login_ticket`
--
ALTER TABLE `login_ticket`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=185;
--
-- AUTO_INCREMENT for table `manager`
--
ALTER TABLE `manager`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `member`
--
ALTER TABLE `member`
MODIFY `id` int(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=51;
--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=72;
--
-- AUTO_INCREMENT for table `no1_car_place`
--
ALTER TABLE `no1_car_place`
MODIFY `id` int(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=14;
--
-- AUTO_INCREMENT for table `no1_floor_1`
--
ALTER TABLE `no1_floor_1`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `order_info`
--
ALTER TABLE `order_info`
MODIFY `order_id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=371;
--
-- AUTO_INCREMENT for table `parking_history`
--
ALTER TABLE `parking_history`
MODIFY `parking_id` int(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=392;
--
-- AUTO_INCREMENT for table `parking_info`
--
ALTER TABLE `parking_info`
MODIFY `parking_id` int(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `problem`
--
ALTER TABLE `problem`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=29;
--
-- AUTO_INCREMENT for table `reply`
--
ALTER TABLE `reply`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=29;
--
-- AUTO_INCREMENT for table `running_data`
--
ALTER TABLE `running_data`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `screen_status`
--
ALTER TABLE `screen_status`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `solutions`
--
ALTER TABLE `solutions`
MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
MODIFY `id` int(11) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=13;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
